const thaiDetect = require('../')

const list = [
    'พ่อพาพวกเราไปเที่ยวสวนสัตว์',
    'เมื่อเช้านี้ฉันเห็นรถจักรยานยนต์ชนคนข้ามถนน',
    'ฉันไม่เคยเห็นทะเล',
    'วันนี้เขาไม่ได้มาโรงเรียน',
    'อะไรอยู่ในตู้',
    'ใครทำอาหารอยู่ในครัว',
    'เธอจะไปกับฉันไหม',
    'หนังสือเล่มนี้เป็นของคุณหรือ',
    'คุณพูดช้าๆ หน่อยซิ',
    'ทำให้เรียบร้อยนะ',
    'ห้ามทิ้งขยะบริเวณนี้',
    'อย่าเล่นในห้องประชุม',
    'แม่ต้องการให้ฉันไปตลาด',
    'น้องอยากดูการ์ตูน',
    'ช่วยเปิดประตูให้ฉันหน่อย',
    'เราไปเดินเล่นกันเถอะ',
    'เข้ามาซิ'
]

list.forEach(l => console.log(thaiDetect.sentence(l)))